In [1]:
#*************PART 14******************

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('student_10.csv')
df

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        NaN        80.0
2  03-07-2019         NaN     10     NaN        3.0        60.0
3  06-07-2019         NaN     11     NaN        0.0         NaN
4  07-07-2019      1005.0     11       A        4.0         NaN
5  08-07-2019         NaN     11       D       10.0         NaN
6  09-07-2019      1007.0     12       B        4.0        80.0
7  10-07-2019      1008.0     12       C        NaN        90.0
8  11-07-2019      1009.0     12       A        NaN        60.0
9  12-07-2019      1010.0     12       D        6.0        85.0

In [4]:
df.interpolate()

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [5]:
#if u wanna fill row by row missing value u have to take axis=0
#and not a single column of dataframe is of object type

In [6]:
df.dtypes

Date           object
Student ID    float64
Class           int64
Section        object
Study hrs     float64
Percentage    float64
dtype: object

In [7]:
#date col have datatype object
#for filling values row by row all should have same dtype

In [9]:
df.interpolate(limit=1)#in first col there are 2 nan values but only one filled 
#by default it is taking method as linear

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019         NaN     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000         NaN
5  08-07-2019      1006.0     11       D  10.000000         NaN
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A        NaN        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [10]:
df.interpolate(limit=2)

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000         NaN
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [12]:
#limit_direction = forward,backward,both  ***default it is forward

In [14]:
df.interpolate(limit=1,limit_direction='backward')#in 1st col 2 values are missing but below value is filled only

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019         NaN     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000         NaN
4  07-07-2019      1005.0     11       A   4.000000         NaN
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C        NaN        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [15]:
df.interpolate(limit=2,limit_direction='backward')

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000         NaN
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [18]:
df.interpolate(limit=2,limit_direction='both')#both upper and lower value filled

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [20]:
df.interpolate(limit_area='inside')#all nan values filled

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [23]:
df.interpolate(limit_area='outside')#no values filled

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A        2.0        50.0
1  02-07-2019      1002.0     10     NaN        NaN        80.0
2  03-07-2019         NaN     10     NaN        3.0        60.0
3  06-07-2019         NaN     11     NaN        0.0         NaN
4  07-07-2019      1005.0     11       A        4.0         NaN
5  08-07-2019         NaN     11       D       10.0         NaN
6  09-07-2019      1007.0     12       B        4.0        80.0
7  10-07-2019      1008.0     12       C        NaN        90.0
8  11-07-2019      1009.0     12       A        NaN        60.0
9  12-07-2019      1010.0     12       D        6.0        85.0

In [24]:
#'inside': Only fill NaNs surrounded by valid values (interpolate).
#'outside': Only fill NaNs outside valid values (extrapolate)

In [25]:
#''''''''Inplace'''''''''''

In [29]:
df.interpolate(inplace=True)#by default it takes here method=linear and filling the value
df

         Date  Student ID  Class Section  Study hrs  Percentage
0  01-07-2019      1001.0     10       A   2.000000        50.0
1  02-07-2019      1002.0     10     NaN   2.500000        80.0
2  03-07-2019      1003.0     10     NaN   3.000000        60.0
3  06-07-2019      1004.0     11     NaN   0.000000        65.0
4  07-07-2019      1005.0     11       A   4.000000        70.0
5  08-07-2019      1006.0     11       D  10.000000        75.0
6  09-07-2019      1007.0     12       B   4.000000        80.0
7  10-07-2019      1008.0     12       C   4.666667        90.0
8  11-07-2019      1009.0     12       A   5.333333        60.0
9  12-07-2019      1010.0     12       D   6.000000        85.0

In [30]:
#***************************PART 15******************************

In [31]:
#loc and iloc

In [32]:
#loc = Access a group of rows and columns by label(s) or a boolean array

In [1]:
import pandas as pd
df=pd.read_csv("student_results.csv")
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

In [37]:
df.loc[0]#in 0th row the number of values with their corresoponding col name is printed

Student ID                1001
Class                       10
Study hrs                    2
Sleeping hrs                 9
Social Media usage hrs       3
Mobile Games hrs             5
Percantege                  50
Name: 0, dtype: int64

In [40]:
#want any value of row

In [39]:
df.loc[4]

Student ID                1005
Class                       11
Study hrs                    4
Sleeping hrs                 7
Social Media usage hrs       2
Mobile Games hrs             0
Percantege                  75
Name: 4, dtype: int64

In [42]:
#u can give multiple index
df.loc[[0,1]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80

In [2]:
df.loc[[2,4]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
2,1003,10,3,8,2,4,60
4,1005,11,4,7,2,0,75

In [ ]:
#we want particular element of df

In [3]:
df.loc[4,'Class']

11

In [4]:
df.loc[0:3,'Class']

0    10
1    10
2    10
3    11
Name: Class, dtype: int64

In [7]:
df.loc[0:3,'Percantege']

0    50
1    80
2    60
3    45
Name: Percantege, dtype: int64

In [9]:
df.loc[[False,False,True]]#returns boolean list as a same index and same row

<class 'IndexError'>: Boolean index has wrong length: 3 instead of 10

In [8]:
#we can use conditional operators

In [12]:
df.loc[df['Class']<11]#In class less than 11 row printed

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60

In [13]:
#now I want less than 11 percentage value
df.loc[df['Class']<11,['Percantege']]

   Percantege
0          50
1          80
2          60

In [14]:
#pandas '''''''''''''''ILOC''''''''''''
#Integer location-based indexing

In [15]:
#in loc we are accessing row and column using labels in iloc we are accessing row and col using indexing

In [16]:
df.iloc[0]

Student ID                1001
Class                       10
Study hrs                    2
Sleeping hrs                 9
Social Media usage hrs       3
Mobile Games hrs             5
Percantege                  50
Name: 0, dtype: int64

In [17]:
df.iloc[[0]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50

In [21]:
df.iloc[:,0]#all row first col #we can't use loc here

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
7    1008
8    1009
9    1010
Name: Student ID, dtype: int64

In [23]:
df.iloc[[0,1]]#returns 0 and 1st index value

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80

In [25]:
df.iloc[[True,False,True,False,True,False,True,False,True,False]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
2,1003,10,3,8,2,4,60
4,1005,11,4,7,2,0,75
6,1007,12,4,6,0,0,80
8,1009,12,2,8,2,4,60

In [26]:
#****************PART 16***********************

GROUPBY fUNCTION =used to split the data into group based on some criteria

In [27]:
#Applying GROUPBY function involves following operations

In [28]:
#--Splitting the object , --Applying a function , --Combining the result

In [30]:
df=pd.read_csv('student_5.csv')
df

   Student ID  Class Section  Study hrs  Percentage
0        1001     10       A          2          50
1        1002     10       B          6          80
2        1003     10       A          3          60
3        1004     11       C          0          45
4        1005     11       C          5          75

In [31]:
gr1=df.groupby(by='Section')
gr1

# when we call groupby function it returns group by object

In [34]:
gr1.groups #it shows group of section

{'A': [0, 2], 'B': [1], 'C': [3, 4]}

In [35]:
df.groupby(['Section','Class']).groups

{('A', 10): [0, 2], ('B', 10): [1], ('C', 11): [3, 4]}

In [36]:
#access the group by using for loop

In [38]:
for Section,df_1 in gr1:
    print(Section)
    print(df_1)

A
   Student ID  Class Section  Study hrs  Percentage
0        1001     10       A          2          50
2        1003     10       A          3          60
B
   Student ID  Class Section  Study hrs  Percentage
1        1002     10       B          6          80
C
   Student ID  Class Section  Study hrs  Percentage
3        1004     11       C          0          45
4        1005     11       C          5          75

In [40]:
list(gr1)#It's converted into list

[('A',
     Student ID  Class Section  Study hrs  Percentage
  0        1001     10       A          2          50
  2        1003     10       A          3          60),
 ('B',
     Student ID  Class Section  Study hrs  Percentage
  1        1002     10       B          6          80),
 ('C',
     Student ID  Class Section  Study hrs  Percentage
  3        1004     11       C          0          45
  4        1005     11       C          5          75)]

In [41]:
#we can convert it into dictionary as well

In [42]:
dict(list(gr1))

{'A':    Student ID  Class Section  Study hrs  Percentage
 0        1001     10       A          2          50
 2        1003     10       A          3          60,
 'B':    Student ID  Class Section  Study hrs  Percentage
 1        1002     10       B          6          80,
 'C':    Student ID  Class Section  Study hrs  Percentage
 3        1004     11       C          0          45
 4        1005     11       C          5          75}

In [44]:
gr3=df.groupby('Class').get_group(10)#according to class value 10 it returns the group
gr3

   Student ID  Class Section  Study hrs  Percentage
0        1001     10       A          2          50
1        1002     10       B          6          80
2        1003     10       A          3          60

In [45]:
gr3=df.groupby('Section').get_group('A')
gr3

   Student ID  Class Section  Study hrs  Percentage
0        1001     10       A          2          50
2        1003     10       A          3          60

In [46]:
#applying a functions into group objects

In [48]:
gr1.sum()#according to section sum

         Student ID  Class  Study hrs  Percentage
Section
A              2004     20          5         110
B              1002     10          6          80
C              2009     22          5         120

In [49]:
gr1.mean()#according to section mean

         Student ID  Class  Study hrs  Percentage
Section
A            1002.0   10.0        2.5        55.0
B            1002.0   10.0        6.0        80.0
C            1004.5   11.0        2.5        60.0

In [50]:
gr1.describe()

        Student ID                                                      \
             count    mean       std     min      25%     50%      75%
Section
A              2.0  1002.0  1.414214  1001.0  1001.50  1002.0  1002.50
B              1.0  1002.0       NaN  1002.0  1002.00  1002.0  1002.00
C              2.0  1004.5  0.707107  1004.0  1004.25  1004.5  1004.75

                Class        ... Study hrs      Percentage                   \
            max count  mean  ...       75%  max      count  mean        std
Section                      ...
A        1003.0   2.0  10.0  ...      2.75  3.0        2.0  55.0   7.071068
B        1002.0   1.0  10.0  ...      6.00  6.0        1.0  80.0        NaN
C        1005.0   2.0  11.0  ...      3.75  5.0        2.0  60.0  21.213203


          min   25%   50%   75%   max
Section
A        50.0  52.5  55.0  57.5  60.0
B        80.0  80.0  80.0  80.0  80.0
C        45.0  52.5  60.0  67.5  75.0

[3 rows x 32 columns]

In [52]:
gr1.agg(['sum','max','mean'])#we can use multiple functions

        Student ID               Class           Study hrs           \
               sum   max    mean   sum max  mean       sum max mean
Section
A             2004  1003  1002.0    20  10  10.0         5   3  2.5
B             1002  1002  1002.0    10  10  10.0         6   6  6.0
C             2009  1005  1004.5    22  11  11.0         5   5  2.5

        Percentage
               sum max  mean
Section
A              110  60  55.0
B               80  80  80.0
C              120  75  60.0

#******************PART 17************************

In [53]:
#MERGE = connects multiple columns or index in DataFrame based on one or more keys

In [78]:
df1=pd.DataFrame({'ID':[1,2,3,5],'Class':[9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   5     12

In [68]:
df2=pd.DataFrame({'ID':[1,2,3,4],'Name':['A','B','C','D']})
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [72]:
pd.merge(df1,df2,on='ID')# we want id same but class and name different

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [65]:
#parameter left,right (in new dataframe first col(df1) is left and (df2) is right

In [74]:
#thus , id from 1st df and name from 2 nd df is merge

In [71]:
# we want id same but class and name different

In [75]:
pd.merge(df2,df1,on='ID')

   ID Name  Class
0   1    A      9
1   2    B     10
2   3    C     11
3   4    D     12

In [77]:
#IF dataframe having different items of id

In [80]:
pd.merge(df2,df1,on='ID')#as the items are not similar it is not printing anything

   ID Name  Class
0   1    A      9
1   2    B     10
2   3    C     11

In [83]:
#next will see ''how''' parameter(it's default parameter is inner)

In [84]:
#inner is intersection

In [88]:
pd.merge(df1,df2,on='ID',how='inner')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

In [89]:
pd.merge(df1,df2,on='ID',how='left')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   5     12  NaN

In [90]:
pd.merge(df1,df2,on='ID',how='right')

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   4    NaN    D

In [93]:
#I want all diff values

In [92]:
pd.merge(df1,df2,on='ID',how='outer')

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   5   12.0  NaN
4   4    NaN    D

In [94]:
pd.merge(df1,df2,on='ID',how='outer',indicator=True)

   ID  Class Name      _merge
0   1    9.0    A        both
1   2   10.0    B        both
2   3   11.0    C        both
3   5   12.0  NaN   left_only
4   4    NaN    D  right_only

In [96]:
#which value belongs to which column known by indicator

In [97]:
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   5     12

In [98]:
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [99]:
#here some values are same in id column but all values are different then so will change 2 nd dataframe

In [100]:
df2=pd.DataFrame({'ID':[5,6,7,8],'Name':['A','B','C','D']})
df2

   ID Name
0   5    A
1   6    B
2   7    C
3   8    D

In [101]:
df1=pd.DataFrame({'ID':[1,2,3,4],'Class':[9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [103]:
#both dataframe id values are different
pd.merge(df1,df2,left_index=True,right_index=True)

   ID_x  Class  ID_y Name
0     1      9     5    A
1     2     10     6    B
2     3     11     7    C
3     4     12     8    D

In [106]:
pd.merge(df1,df2)#if we not use any of that parameter then it returns nothing
#but we have to use both left_index and right_index at same time

Empty DataFrame
Columns: [ID, Class, Name]
Index: []

In [107]:
#if both dataframe are same

In [108]:
df2=pd.DataFrame({'ID':[1,2,3,4],'Class':[9,10,11,12]})
df2

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [109]:
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [111]:
pd.merge(df1,df2,on='ID')#here our suffixes parameter works

   ID  Class_x  Class_y
0   1        9        9
1   2       10       10
2   3       11       11
3   4       12       12

In [112]:
pd.merge(df1,df2,on='ID',suffixes=('_Higher','_Middle'))

   ID  Class_Higher  Class_Middle
0   1             9             9
1   2            10            10
2   3            11            11
3   4            12            12